const pilgrimData = [
    {
        "寺廟名":"松山慈惠堂",
        "地 址":"台北市松山區福德街251巷33號",
        "聯絡電話":"02-27261735",
        "說 明":"費用逕洽。禪房60餘間"
    },
    {
        "寺廟名":"松山奉天宮",
        "地 址":"台北市松山區福德街177巷11號",
        "聯絡電話":"02-27279765, 02-27277302",
        "說 明":"費用逕洽。"
    },
    {
        "寺廟名":"內湖碧山巖",
        "地 址":"台北市碧山路24號",
        "聯絡電話":"02-27900657",
        "說 明":"費用逕洽。套房 、通舖。"
    },
    {
        "寺廟名":"石碇姑娘廟",
        "地 址":"新北市石碇區永定村大湖格路22之1號",
        "聯絡電話":"02-26631937, 02-26631678",
        "說 明":"費用逕洽。"
    },
    {
        "寺廟名":"獅頭山勸化堂",
        "地 址":"苗栗縣南庄鄉獅山村17鄰242號",
        "聯絡電話":"037-823-895, 037-822-020",
        "說 明":"2人套房$1000，4人通舖$800，早餐$60，午晚餐$80"
    },
    {
        "寺廟名":"白沙屯拱天宮媽祖廟",
        "地 址":"苗栗縣通霄鎮白東里8號",
        "聯絡電話":"03-779-2058",
        "說 明":"通舖$200，2 - 4人房 $1200-1800"
    },
    {
        "寺廟名":"長和宮",
        "地 址":"新竹",
        "聯絡電話":null,
        "說 明":"兩人房1500"
    },
    {
        "寺廟名":"五指山灶君堂",
        "地 址":"新竹縣北埔鄉外坪村8鄰六股11之12號",
        "聯絡電話":"03-580-2049",
        "說 明":"2人套房$400，齋飯$100"
    },
    {
        "寺廟名":"五指山玉皇宮",
        "地 址":"新竹縣北埔鄉外坪村8鄰11號",
        "聯絡電話":"03-580-2052",
        "說 明":"2人套房$400，齋飯$100"
    },
    {
        "寺廟名":"五指山觀音禪寺",
        "地 址":"新竹縣竹東鎮瑞峰里4鄰94號",
        "聯絡電話":"03-580-1429",
        "說 明":"2人套房$400，齋飯$100"
    },
    {
        "寺廟名":"大甲鎮瀾宮",
        "地 址":"台中市大甲區孔雀路19之1號",
        "聯絡電話":"04-26763522",
        "說 明":"上下通舖8-10人房，男女分房，清潔費$100，+隨喜香油錢"
    },
    {
        "寺廟名":"大甲西靈宮",
        "地 址":"台中市大甲區成功路251巷1號",
        "聯絡電話":"04-26871184",
        "說 明":"費用逕洽。"
    },
    {
        "寺廟名":"無極三清總道院",
        "地 址":"台中市外埔區水美村山腳巷",
        "聯絡電話":"04-26868999, 04-26865699",
        "說 明":"住宿請先預約"
    },
    {
        "寺廟名":"谷關大道院",
        "地 址":"台中市和平區東關路1段450號",
        "聯絡電話":"04-25943555",
        "說 明":"隨喜，中橫另有露營區"
    },
    {
        "寺廟名":"松柏嶺受天宮香客大樓",
        "地 址":"南投縣名間鄉松山村松山街118號",
        "聯絡電話":"049-2581008",
        "說 明":"隨喜，住宿請先預約"
    },
    {
        "寺廟名":"彰化文德宮",
        "地 址":"彰化縣花壇鄉白沙村彰員路3段6號",
        "聯絡電話":"04-789-3904",
        "說 明":"費用逕洽。"
    },
    {
        "寺廟名":"鹿港天后宮",
        "地 址":"彰化縣鹿港鎮玉順里中山路430號",
        "聯絡電話":"04-775-2508",
        "說 明":"通舖$120，2人$1300元，3人$1300。需預約"
    },
    {
        "寺廟名":"麥寮拱范宫",
        "地 址":"雲林縣麥寮鄕麥豐村中正路3號",
        "聯絡電話":"05-6932033",
        "說 明":"$800"
    },
    {
        "寺廟名":"口湖福安宫",
        "地 址":"雲林縣福鄕下崙福安路22號",
        "聯絡電話":"05-7991628",
        "說 明":"$100\/人"
    },
    {
        "寺廟名":"土库顺天宫",
        "地 址":"雲林縣土库镇中正路109號",
        "聯絡電話":"05-6622658",
        "說 明":"$500"
    },
    {
        "寺廟名":"斗六南聖宫",
        "地 址":"雲林縣斗六市南聖路301號",
        "聯絡電話":"05-5325335",
        "說 明":"費用逕洽。"
    },
    {
        "寺廟名":"斗南顺安宫",
        "地 址":"雲林縣斗南镇明昌里长安路1段126號",
        "聯絡電話":"05-5972541",
        "說 明":"$900"
    },
    {
        "寺廟名":"北港朝天宮",
        "地 址":"雲林縣北港镇中山路178號",
        "聯絡電話":"05-7831151",
        "說 明":"套房及通舖，随喜"
    },
    {
        "寺廟名":"五條港安西府",
        "地 址":"雲林縣台西鄕中央路76號",
        "聯絡電話":"05-6982054",
        "說 明":"随喜"
    },
    {
        "寺廟名":"台西安海宫",
        "地 址":"雲林縣台西鄕民權路6巷2號",
        "聯絡電話":"05-6982004",
        "說 明":"$500"
    },
    {
        "寺廟名":"三條崙海清宮",
        "地 址":"雲林縣四湖鄉崙北村海清宮93號",
        "聯絡電話":"05-7721005 \/ 05-7721741",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"四湖參天宮",
        "地 址":"雲林縣四湖鄉湖西村關聖路87號",
        "聯絡電話":"05-7872052",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"東勢賜安宮",
        "地 址":"雲林縣東勢鄉東南村四安路25號",
        "聯絡電話":"05-6991025",
        "說 明":"$300"
    },
    {
        "寺廟名":"馬鳴山鎮安宮",
        "地 址":"雲林縣褒忠鄉馬鳴村鎮安路31號",
        "聯絡電話":"05-3794265",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"朴子配天宮",
        "地 址":"嘉義縣朴子市黎明路1號之3",
        "聯絡電話":"05-3794265",
        "說 明":"通舖，$100-200"
    },
    {
        "寺廟名":"東石先天宮",
        "地 址":"嘉義縣東石鄉東石村246號",
        "聯絡電話":"05-3730597",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"新港奉天宮",
        "地 址":"嘉義縣新港鄉新民路53號",
        "聯絡電話":"05-3742034",
        "說 明":"通舖，隨喜"
    },
    {
        "寺廟名":"台南開元禪寺",
        "地 址":"台南市北區北園街89號",
        "聯絡電話":"06-2375635",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"安平天后宮",
        "地 址":"台南市安平區國勝路33號",
        "聯絡電話":"06-2238695",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"鹿耳門聖母廟",
        "地 址":"台南市安南區城安路160號",
        "聯絡電話":"06-2577547 \/ 06-2566523",
        "說 明":"4人房$800，通舖$600（團體定房）"
    },
    {
        "寺廟名":"北極殿玄天上帝廟",
        "地 址":"台南市下營區下營村中山路1段1號",
        "聯絡電話":"06-6892362",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"南鯤身代天府槺榔山莊",
        "地 址":"台南市北門區鯤江村976號",
        "聯絡電話":"06-7864711",
        "說 明":"通舖$100，2人$1200"
    },
    {
        "寺廟名":"驪山老母宮",
        "地 址":"台南市南化區南化村14鄰289之1號",
        "聯絡電話":"06-5773202",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"北極殿玄天上帝廟",
        "地 址":"台南市下營區下營村中山路1段1號",
        "聯絡電話":"06-6892362",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"南鯤身代天府槺榔山莊",
        "地 址":"台南市北門區鯤江村976號",
        "聯絡電話":"06-7864711",
        "說 明":"通舖$100，2人$1200"
    },
    {
        "寺廟名":"驪山老母宮",
        "地 址":"台南市南化區南化村14鄰289之1號",
        "聯絡電話":"06-5773202",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"內門順賢宮益賢山莊",
        "地 址":"高雄市內門區內南里菜園頂8-8號",
        "聯絡電話":"07-6674820",
        "說 明":"隨喜"
    },
    {
        "寺廟名":"南海紫竹寺",
        "地 址":"高雄市內門區內豐村82號",
        "聯絡電話":"07-6671400",
        "說 明":"隨喜"
    },
    {
        "寺廟名":"東照山關帝廟",
        "地 址":"高雄市大樹區小坪村忠義路1號",
        "聯絡電話":"07-3710981 \/ 07-3713930",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"佛光山麻竹園",
        "地 址":"高雄市大樹區興田村興田路153號",
        "聯絡電話":"07-6561921 #8100",
        "說 明":"2-8人房$2000，需預約"
    },
    {
        "寺廟名":"甲仙龍鳳寺",
        "地 址":"高雄市甲仙區西安村和南巷2號",
        "聯絡電話":"07-7712335 \/ 0929986742",
        "說 明":"隨喜，通舖"
    },
    {
        "寺廟名":"開玉府天宮",
        "地 址":"高雄市甲仙區西安村和南巷6號",
        "聯絡電話":"07-6751349 \/ 07-6751414",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"甲仙王母宮",
        "地 址":"高雄市甲仙區東安村油礦巷3號",
        "聯絡電話":"07-6751309 \/ 0937640696",
        "說 明":"隨喜，通舖"
    },
    {
        "寺廟名":"五龍山鳳山寺",
        "地 址":"高雄市旗山區東昌里南察巷37號",
        "聯絡電話":"07-6612768 \/ 07-6621766",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"靈隱寺",
        "地 址":"高雄市寶隆村光華路28號",
        "聯絡電話":"07-6752123",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"楓港普濟禪寺",
        "地 址":"屏東縣楓港區獅子鄉龍山路118號",
        "聯絡電話":"08-8772326",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"楓港龍峰寺",
        "地 址":"屏東縣楓港區獅子鄉龍山路121號",
        "聯絡電話":"08-8771373",
        "說 明":"隨喜"
    },
    {
        "寺廟名":"龍華三宮",
        "地 址":"屏東縣屏東市中正路748巷11號",
        "聯絡電話":"08-7362775 \/ 08-7361402",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"車城福安宮",
        "地 址":"屏東縣車城鄉福安村忠孝路199號 (近墾丁)",
        "聯絡電話":"08-8825301 \/ 08-8825302",
        "說 明":"假日套房$1500"
    },
    {
        "寺廟名":"東隆宮香客大樓",
        "地 址":"屏東縣東港鎮東隆街21-1號",
        "聯絡電話":"08-8322374",
        "說 明":"隨喜（只開放團體預約）"
    },
    {
        "寺廟名":"照靈宮香客中心",
        "地 址":"屏東縣滿洲鄉中山路107號",
        "聯絡電話":"08-8801133",
        "說 明":"$250\/人"
    },
    {
        "寺廟名":"礁溪協天廟",
        "地 址":"宜蘭縣大忠村中山路1段51號",
        "聯絡電話":"03-9880671",
        "說 明":200
    },
    {
        "寺廟名":"冬山三清宮",
        "地 址":"宜蘭縣冬山鄉得安三清路123號(梅花湖)",
        "聯絡電話":"03-9515135 \/ 03-9515137",
        "說 明":"$250\/人，需先預約"
    },
    {
        "寺廟名":"宜蘭爐源寺",
        "地 址":"宜蘭縣維揚路515巷16號",
        "聯絡電話":"03-9542089 \/ 03-9518825",
        "說 明":"費用逕洽"
    },
    {
        "寺廟名":"大里天公廟",
        "地 址":"宜蘭縣頭城鎮石城路121號",
        "聯絡電話":"03-9781075",
        "說 明":"隨喜"
    },
    {
        "寺廟名":"大福補天宮",
        "地 址":"宜蘭縣壯圍鄉壯濱路六段279號",
        "聯絡電話":"03-930 1171",
        "說 明":null
    },
    {
        "寺廟名":"金媽祖香客大樓",
        "地 址":"宜蘭縣蘇澳鎮南正里江夏路17號",
        "聯絡電話":"03-9962726 \/ 03-9973774",
        "說 明":"費用逕洽（套房）"
    },
    {
        "寺廟名":"保祿牧靈中心",
        "地 址":"花蓮市民權路一街3號",
        "聯絡電話":"03-8327540",
        "說 明":"$200以上（套房、通舖），2人套房$900"
    },
    {
        "寺廟名":"慈惠石壁部堂",
        "地 址":"花蓮市國福里119號",
        "聯絡電話":"03-8579882",
        "說 明":"通舖式套房，供餐隨喜"
    },
    {
        "寺廟名":"慈懿道院",
        "地 址":"花蓮市德興184號",
        "聯絡電話":"03-8560612",
        "說 明":"隨喜（通舖）"
    },
    {
        "寺廟名":"花蓮港天宮",
        "地 址":"花蓮市德興207-55號",
        "聯絡電話":"03-8560031",
        "說 明":"$130\/人"
    },
    {
        "寺廟名":"吉安五谷宮",
        "地 址":"花蓮縣吉安鄉中山路3段99巷18號",
        "聯絡電話":"03-8521334",
        "說 明":"$100\/人（套房、通舖）"
    },
    {
        "寺廟名":"吉安禪靜中心",
        "地 址":"花蓮縣吉安鄉吉昌二街28號",
        "聯絡電話":"03-8530971",
        "說 明":"隨喜（通舖2間、4人房10間）"
    },
    {
        "寺廟名":"天真聖宮",
        "地 址":"花蓮縣吉安鄉吉祥4街52號",
        "聯絡電話":"03-8534819",
        "說 明":"$100\/人（通舖、男女分宿）"
    },
    {
        "寺廟名":"吉安勝安宮",
        "地 址":"花蓮縣吉安鄉慈惠三街118號",
        "聯絡電話":"03-8528658",
        "說 明":"$100\/人（通舖）"
    },
    {
        "寺廟名":"聖地慈惠堂",
        "地 址":"花蓮縣吉安鄉慈惠三街136號",
        "聯絡電話":"03-8531886",
        "說 明":"隨喜（通舖上下舖）"
    },
    {
        "寺廟名":"法華山慈惠堂",
        "地 址":"花蓮縣吉安鄉慈雲52號",
        "聯絡電話":"03-8759792",
        "說 明":"隨喜（通舖）"
    },
    {
        "寺廟名":"瑞穗青蓮寺",
        "地 址":"花蓮縣瑞穗鄉瑞美村仁愛路109號",
        "聯絡電話":"03-8875438 \/ 0911354063",
        "說 明":"$250-300\/人，不供膳"
    },
    {
        "寺廟名":"台東南王湄聖宮",
        "地 址":"台東市南王里更生北路731巷9號之1",
        "聯絡電話":"089-224128",
        "說 明":"$200\/人，通舖容140人，不供餐"
    },
    {
        "寺廟名":"鹿野高台碧峰禪寺",
        "地 址":"台東縣又9號南下約347.6Km處台塑加油站右轉上坡約3Km",
        "聯絡電話":"089-550058",
        "說 明":"隨喜"
    },
    {
        "寺廟名":"池上北極玄天宮",
        "地 址":"台東縣池上鄉富興村34號之1",
        "聯絡電話":"089-863366",
        "說 明":"套房式通舖（8-12人）供餐，功德隨喜"
    },
    {
        "寺廟名":"知本忠義堂",
        "地 址":"台東縣卑南鄉溫泉村",
        "聯絡電話":"089-512884",
        "說 明":"除初一至初五每房$1000（上下舖及通舖），其他時間及溫泉隨喜。無餐，9PM前入住"
    },
    {
        "寺廟名":"知本福靈宮",
        "地 址":"台東縣卑南鄉溫泉村溫泉路408巷36號",
        "聯絡電話":"089-510043",
        "說 明":"18間雅房（4-5人），平日隨喜。過年每間$1500，學生免費"
    },
    {
        "寺廟名":"知本玉明宮",
        "地 址":"台東縣卑南鄉溫泉村龍泉路128巷6號",
        "聯絡電話":"089-513823 \/ 0932518077",
        "說 明":"2間通舖（7人、$1000）1間雅房（4人、$1000）露天溫泉功德隨喜。住宿用餐需預約"
    },
    {
        "寺廟名":"關山佛緣禪寺",
        "地 址":"台東縣海瑞鄉崁頂村中石76號",
        "聯絡電話":"089-810184 \/ 089-811945",
        "說 明":"隨喜"
    },
    {
        "寺廟名":"寶華山慈惠堂",
        "地 址":"台東縣鹿野鄉瑞和村23鄰仙山2號",
        "聯絡電話":"089-581229",
        "說 明":"隨喜"
    }
];